[
  {
    "id": "1",
    "title": "Exploring the Amazon Rainforest",
    "image": "https://i.ibb.co.com/P957jYM/Home-Mountain-Treks-01-04-2025-08-28-PM.png",
    "description": "Embark on a thrilling journey through the world's largest tropical rainforest.",
    "live": "https://mountain-projects.web.app",
    "technologiesUsed": ["React", "Firebase", "Tailwind CSS", "AOS (Animate on Scroll)"],
    "keyLearningsImprovements": "Enhanced design using animations with AOS, significantly improving user engagement. Gained practical experience in setting up secure Firebase rules to protect real-time data. Learned to optimize components for performance and ensure accessibility compliance in dynamic content."
  },
  {
    "id": "2",
    "title": "Discovering Top Universities Abroad",
    "image": "https://i.ibb.co.com/Xt476tw/Home-Abroad-University-01-04-2025-09-23-PM.png",
    "description": "Learn about the best universities abroad and their unique programs.",
    "live": "https://harvard-university-11.netlify.app",
    "technologiesUsed": ["React", "tailwind", "firebase", "React Router", "mongodb"],
    "keyLearningsImprovements": "Improved SPA routing and responsiveness using React Router and Bootstrap, ensuring a smooth user experience. Learned to deploy and debug projects on Netlify for faster iteration. Mastered creating scalable UI components that adapt seamlessly across all devices while maintaining design consistency."
  },
  {
    "id": "3",
    "title": "Marvel Movies: A Cinematic Universe",
    "image": "https://i.ibb.co.com/9cXTvbN/Home-Marvel-Movies-01-04-2025-09-11-PM.png",
    "description": "Dive into the world of Marvel movies and explore their epic storytelling.",
    "live": "https://marvel-movies-pro.netlify.app",
    "technologiesUsed": ["React", "Firebase", "React Simple Star Rating", "Netlify"],
    "keyLearningsImprovements": "Developed dynamic star rating functionality, improving the interactivity of user reviews. Mastered React Router for seamless multi-page navigation and learned to handle dynamic paths for better scalability. Gained hands-on experience in Firebase authentication and integrating a secure backend to manage user data effectively."
  }
]
